<a href="https://colab.research.google.com/github/fr3drikk/the_dream_team-/blob/main/Sorting_Dream_team0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Imports

In [13]:
# Standard stuff
import pandas as pd #for manipulating data
import numpy as np #for manipulating data

# Dataviz
import matplotlib.pyplot as plt #for custom graphs at the end
import seaborn as sns #for custom graphs at the end

# Altair
import altair as alt

# Other tooling
# import os #needed to use Environment Variables in Domino

# UML
# from sklearn.preprocessing import StandardScaler # import and instantiate scaler

# SML
# import sklearn #for building models
# import xgboost as xgb #for building models
# import sklearn.ensemble #for building models
# from sklearn.model_selection import train_test_split #for creating a hold-out sample
# from sklearn import datasets # Boston Housing Data

In [14]:
jobs = pd.read_csv('https://raw.githubusercontent.com/fr3drikk/the_dream_team-/main/App/Data/jobs.csv')

### Looking through general info from the data

In [15]:
# First we check the shape of the data.
jobs.shape

(84090, 22)

In [16]:
# Secondly we check the dataset for what object is.
jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84090 entries, 0 to 84089
Data columns (total 22 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Job.ID              84090 non-null  int64
 1   Provider            84090 non-null  int64
 2   Status              84090 non-null  object
 3   Slug                84090 non-null  object
 4   Title               84090 non-null  object
 5   Position            84090 non-null  object
 6   Company             81819 non-null  object
 7   City                83955 non-null  object
 8   State.Name          83919 non-null  object
 9   State.Code          83919 non-null  object
 10  Address             36 non-null     object
 11  Latitude            84090 non-null  float64
 12  Longitude           84090 non-null  float64
 13  Industry            267 non-null    object
 14  Requirements        0 non-null      float64
 15  Salary              229 non-null    float64
 16  Listing.Start       83407 non-null  object
 17  Listing.End         83923 non-null  object
 18  Employment.Type     84080 non-null  object
 19  Education.Required  83823 non-null  object
 20  Created.At          84090 non-null  object
 21  Updated.At          84090 non-null  object
dtypes: float64(4), int64(2), object(16)
memory usage: 14.1+ MB

In [17]:
# Checking how the data looks: From the data, we see that there are several columns with NaN values, such as; Requirements, Listing.Start, Listing.End. 

jobs.head()

,Job.ID,Provider,Status,Slug,Title,Position,Company,City,State.Name,State.Code,...,Longitude,Industry,Requirements,Salary,Listing.Start,Listing.End,Employment.Type,Education.Required,Created.At,Updated.At
0,111,1,open,palo-alto-ca-tacolicious-server,Server @ Tacolicious,Server,Tacolicious,Palo Alto,California,CA,...,-122.161170,Food and Beverages,NaN,8.00,NaN,NaN,Part-Time,NaN,2013-03-12 02:08:28 UTC,2014-08-16 15:35:36 UTC
1,113,1,open,san-francisco-ca-claude-lane-kitchen-staff-chef,Kitchen Staff/Chef @ Claude Lane,Kitchen Staff/Chef,Claude Lane,San Francisco,California,CA,...,-122.404268,Food and Beverages,NaN,0.00,NaN,NaN,Part-Time,NaN,2013-04-12 08:36:36 UTC,2014-08-16 15:35:36 UTC
2,117,1,open,san-francisco-ca-machka-restaurants-corp-barte...,Bartender @ Machka Restaurants Corp.,Bartender,Machka Restaurants Corp.,San Francisco,California,CA,...,-122.402963,Food and Beverages,NaN,11.00,NaN,NaN,Part-Time,NaN,2013-07-16 09:34:10 UTC,2014-08-16 15:35:37 UTC
3,121,1,open,brisbane-ca-teriyaki-house-server,Server @ Teriyaki House,Server,Teriyaki House,Brisbane,California,CA,...,-122.400275,Food and Beverages,NaN,10.55,NaN,NaN,Part-Time,NaN,2013-09-04 15:40:30 UTC,2014-08-16 15:35:38 UTC
4,127,1,open,los-angeles-ca-rosa-mexicano-sunset-kitchen-st...,Kitchen Staff/Chef @ Rosa Mexicano - Sunset,Kitchen Staff/Chef,Rosa Mexicano - Sunset,Los Angeles,California,CA,...,-118.460439,Food and Beverages,NaN,10.55,NaN,NaN,Part-Time,NaN,2013-07-17 15:26:18 UTC,2014-08-16 15:35:40 UTC

In [18]:
# We will look through the data to see to what extend we have missing values next.
# We use sum() and sort_values to get a descending list.
jobs.isna().sum().sort_values()

Job.ID                    0
Longitude                 0
Latitude                  0
Created.At                0
Position                  0
Updated.At                0
Slug                      0
Status                    0
Provider                  0
Title                     0
Employment.Type          10
City                    135
Listing.End             167
State.Name              171
State.Code              171
Education.Required      267
Listing.Start           683
Company                2271
Industry              83823
Salary                83861
Address               84054
Requirements          84090
dtype: int64

In [19]:
# Looking here, we can see 4 columns that are irellevant, as they are mostly empty. These are: Salary, Industry, Requirements and Address
# We therefore elect to drop them from the dataset. 
jobs = jobs.drop(['Industry', 'Salary', 'Address', 'Requirements'], axis=1)

In [20]:
# We check that we successfully dropped the columns.
jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84090 entries, 0 to 84089
Data columns (total 18 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Job.ID              84090 non-null  int64
 1   Provider            84090 non-null  int64
 2   Status              84090 non-null  object
 3   Slug                84090 non-null  object
 4   Title               84090 non-null  object
 5   Position            84090 non-null  object
 6   Company             81819 non-null  object
 7   City                83955 non-null  object
 8   State.Name          83919 non-null  object
 9   State.Code          83919 non-null  object
 10  Latitude            84090 non-null  float64
 11  Longitude           84090 non-null  float64
 12  Listing.Start       83407 non-null  object
 13  Listing.End         83923 non-null  object
 14  Employment.Type     84080 non-null  object
 15  Education.Required  83823 non-null  object
 16  Created.At          84090 non-null  object
 17  Updated.At          84090 non-null  object
dtypes: float64(2), int64(2), object(14)
memory usage: 11.5+ MB

In [21]:
# As we see, there are still values which are NaN, as they don't constitute a large part of the dataset, we elect to remove those as well.
jobs.isna().sum().sort_values()

Job.ID                   0
Longitude                0
Latitude                 0
Created.At               0
Position                 0
Updated.At               0
Slug                     0
Status                   0
Provider                 0
Title                    0
Employment.Type         10
City                   135
Listing.End            167
State.Code             171
State.Name             171
Education.Required     267
Listing.Start          683
Company               2271
dtype: int64

In [22]:

jobs = jobs.dropna()

In [23]:
# Our total dataset row-size ends up being 80865, which is acceptable, as it is not even a 10% loss of data. 
jobs.shape

(80865, 18)

### Looking through all the variables

In [24]:
# We check the data-types of each variable.
jobs.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 80865 entries, 8 to 83980
Data columns (total 18 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Job.ID              80865 non-null  int64
 1   Provider            80865 non-null  int64
 2   Status              80865 non-null  object
 3   Slug                80865 non-null  object
 4   Title               80865 non-null  object
 5   Position            80865 non-null  object
 6   Company             80865 non-null  object
 7   City                80865 non-null  object
 8   State.Name          80865 non-null  object
 9   State.Code          80865 non-null  object
 10  Latitude            80865 non-null  float64
 11  Longitude           80865 non-null  float64
 12  Listing.Start       80865 non-null  object
 13  Listing.End         80865 non-null  object
 14  Employment.Type     80865 non-null  object
 15  Education.Required  80865 non-null  object
 16  Created.At          80865 non-null  object
 17  Updated.At          80865 non-null  object
dtypes: float64(2), int64(2), object(14)
memory usage: 11.7+ MB

In [25]:
# Change We change the columns which correspond to date, from object to timebased. 

jobs['Listing.Start'] = pd.to_datetime(jobs['Listing.Start'])
jobs['Listing.End'] = pd.to_datetime(jobs['Listing.End'])

In [26]:
# We do the same for the Created and Updated columns
jobs['Created.At'] = pd.to_datetime(jobs['Created.At'])
jobs['Updated.At'] = pd.to_datetime(jobs['Updated.At'])

In [27]:
# We check to make sure that the formats have been changed correctly, and see that Listing columns are correctly formatted. 
# This is also the case for Created columns, and the time of day has been correctly taken into account
jobs.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 80865 entries, 8 to 83980
Data columns (total 18 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Job.ID              80865 non-null  int64
 1   Provider            80865 non-null  int64
 2   Status              80865 non-null  object
 3   Slug                80865 non-null  object
 4   Title               80865 non-null  object
 5   Position            80865 non-null  object
 6   Company             80865 non-null  object
 7   City                80865 non-null  object
 8   State.Name          80865 non-null  object
 9   State.Code          80865 non-null  object
 10  Latitude            80865 non-null  float64
 11  Longitude           80865 non-null  float64
 12  Listing.Start       80865 non-null  datetime64[ns]
 13  Listing.End         80865 non-null  datetime64[ns]
 14  Employment.Type     80865 non-null  object
 15  Education.Required  80865 non-null  object
 16  Created.At          80865 non-null  datetime64[ns, UTC]
 17  Updated.At          80865 non-null  datetime64[ns, UTC]
dtypes: datetime64[ns, UTC](2), datetime64[ns](2), float64(2), int64(2), object(10)
memory usage: 11.7+ MB

In [28]:
# Next we look into unique values to find out if any of the variables makes sense to transform into more meaningful values
jobs.nunique()

Job.ID                80865
Provider                  1
Status                    1
Slug                  80865
Title                 40179
Position              35091
Company                8155
City                   5410
State.Name               51
State.Code               51
Latitude              13992
Longitude             14177
Listing.Start            72
Listing.End              67
Employment.Type           6
Education.Required        5
Created.At            57278
Updated.At            57055
dtype: int64

In [29]:
# We chose to look into Employment.Type and Education.Required, as those two don't have a massive amount of unique values. 
jobs['Employment.Type'].unique()

array(['Part-Time', 'Full-Time/Part-Time', 'Seasonal/Temp', 'Per Diem',
       'Intern', 'Full-Time'], dtype=object)

In [30]:
# As we can see, there are some lables that are duplicates, like "Temporary/seasonal" and "Seasonal/Temp". 
# We combine the two into one label. 
jobs['Employment.Type'] = jobs['Employment.Type'].replace(['Seasonal/Temp'], 'Temporary/seasonal')

In [31]:
# We also change nan labels into str: Unspecified.
jobs['Employment.Type'] = jobs['Employment.Type'].fillna('Unspecified')

In [32]:
# Next we look at Education Required. Here we see that nan, Not Specified, are basically the same labels. 
jobs['Education.Required'].unique()

array(['Not Specified', 'High School Diploma', "Master's Degree",
       'Associate Degree', "Bachelor's Degree"], dtype=object)

In [33]:
# Here we fill the nan values with the value 'Unspecified', thereby converting it to a str-value.
jobs['Education.Required'] = jobs['Education.Required'].fillna('Unspecified')

In [34]:
# Next we replace 'Not Specified' with 'Unspecified' thereby collecting both labels into one label.
jobs['Education.Required'] = jobs['Education.Required'].replace(['Not Specified'] , 'Unspecified')

In [35]:
# Lastly we check that everything went according to plan.
jobs['Education.Required'].unique()

array(['Unspecified', 'High School Diploma', "Master's Degree",
       'Associate Degree', "Bachelor's Degree"], dtype=object)

In [56]:
# We group the positions that are similar to each other

# Customer service
jobs['Position'] = jobs['Position'].replace(['Customer Service Representative'] , 'Customer Service')
jobs['Position'] = jobs['Position'].replace(['Customer Service / Sales ( New Grads Welcome!)'] , 'Customer Service')
jobs['Position'] = jobs['Position'].replace(['Customer Service / Sales ( New Grads Welcome! )'] , 'Customer Service')
jobs['Position'] = jobs['Position'].replace(['Entry Level Sales / Customer Service – Part time / Full Time'] , 'Customer Service')

# Accounting
jobs['Position'] = jobs['Position'].replace(['Accounts Payable Clerk'] , 'Accounting')
jobs['Position'] = jobs['Position'].replace(['Accounting Clerk'] , 'Accounting')
jobs['Position'] = jobs['Position'].replace(['Accounts Receivable Clerk'] , 'Accounting')
jobs['Position'] = jobs['Position'].replace(['Bookkeeper'] , 'Accounting')
jobs['Position'] = jobs['Position'].replace(['Full Charge Bookkeeper'] , 'Accounting')
jobs['Position'] = jobs['Position'].replace(['Payroll Clerk'] , 'Accounting')
jobs['Position'] = jobs['Position'].replace(['Billing Clerk'] , 'Accounting')
jobs['Position'] = jobs['Position'].replace(['Payroll Administrator'] , 'Accounting')
jobs['Position'] = jobs['Position'].replace(['Staff Accountant'] , 'Accounting')
jobs['Position'] = jobs['Position'].replace(['Senior Accountant'] , 'Accounting')

# Sales
jobs['Position'] = jobs['Position'].replace(['Sales Representative / Sales Associate ( Entry Level )'] , 'Sales')
jobs['Position'] = jobs['Position'].replace(['Sales Associate'] , 'Sales')
jobs['Position'] = jobs['Position'].replace(['Seasonal Wedding Sales Stylist'] , 'Sales')
jobs['Position'] = jobs['Position'].replace(['Retail Sales Associate - Part-Time'] , 'Sales')
jobs['Position'] = jobs['Position'].replace(['Retail Sales Associate'] , 'Sales')

# Administration
jobs['Position'] = jobs['Position'].replace(['Administrative Assistant'] , 'Administration')
jobs['Position'] = jobs['Position'].replace(['Receptionist'] , 'Administration')
jobs['Position'] = jobs['Position'].replace(['Front Desk Coordinator'] , 'Administration')
jobs['Position'] = jobs['Position'].replace(['Executive Assistant'] , 'Administration')
jobs['Position'] = jobs['Position'].replace(['General Office Clerk '] , 'Administration')
jobs['Position'] = jobs['Position'].replace(['Office Assistant'] , 'Administration')

# Restaurant
jobs['Position'] = jobs['Position'].replace(['Bartender'] , 'Restaurant')
jobs['Position'] = jobs['Position'].replace(['Server'] , 'Administration')
jobs['Position'] = jobs['Position'].replace(['Kitchen Staff'] , 'Administration')

# Caregiving

In [54]:
jobs['Position'].nunique()

35069

In [53]:
jobs['Position'].value_counts().nlargest(30)

Accounting                                                                                   5154
Administration                                                                               3095
Customer Service                                                                             2052
Sales                                                                                        1799
Data Entry Clerk                                                                              612
Retail Sales Associate – Part-Time                                                            497
Seasonal CSR                                                                                  314
Human Resources Assistant                                                                     274
General Office Clerk                                                                          262
Collections Specialist                                                                        250
Hiring All Restaurant Positions - Servers - Cooks - Bartenders                                233
Caregiver / Home Health Aide / CNA                                                            201
Entry Level Caregiver / Home Health Aide                                                      200
HVAC CAREER TRAINING - LOCAL HEATING, AIR CONDITIONING & REFRIGERATION TRAINING AVAILABLE     200
Merchandisers                                                                                 200
Security Officer                                                                              191
Part Time School Bus Drivers WANTED - Training Available                                      182
Event Specialist Part Time Sales                                                              175
Retail Sales Associate / Photographer                                                         172
CASHIER                                                                                       170
Retail Sales Associate - Part Time                                                            170
Event Specialist Part Time                                                                    169
Assistant Teacher                                                                             163
Accountant - Entry Level                                                                      162
Sales Assistant                                                                               159
Financial Analyst                                                                             159
DI Special Services Brand Ambassador - Market                                                 154
Cook                                                                                          154
COSMETOLOGY / SALON CAREER TRAINING - LOCAL HAIR / MAKEUP TRAINING AVAILABLE                  150
Registered Nurse                                                                              145
Name: Position, dtype: int64

#### User Job views

In [ ]:
user_view = pd.read_csv('https://raw.githubusercontent.com/fr3drikk/the_dream_team-/main/App/Data/user_job_views.csv')

In [ ]:
user_view.shape

(12370, 13)

In [ ]:
user_view.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12370 entries, 0 to 12369
Data columns (total 13 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Applicant.ID   12370 non-null  int64
 1   Job.ID         12370 non-null  int64
 2   Title          12370 non-null  object
 3   Company        11790 non-null  object
 4   City           12370 non-null  object
 5   State.Name     12348 non-null  object
 6   State.Code     12348 non-null  object
 7   Industry       2199 non-null   object
 8   View.Start     12370 non-null  object
 9   View.End       10575 non-null  object
 10  View.Duration  10575 non-null  float64
 11  Created.At     12370 non-null  object
 12  Updated.At     12370 non-null  object
dtypes: float64(1), int64(2), object(10)
memory usage: 1.2+ MB

In [ ]:
user_view.isna().sum().sort_values()

Applicant.ID         0
Job.ID               0
Title                0
City                 0
View.Start           0
Created.At           0
Updated.At           0
State.Name          22
State.Code          22
Company            580
View.End          1795
View.Duration     1795
Industry         10171
dtype: int64

In [ ]:
user_view = user_view.drop(['Industry'], axis=1)

In [ ]:
user_view['Company'] = user_view['Company'].fillna('Unspecified')

In [ ]:
user_view.isna().sum().sort_values()

Applicant.ID        0
Job.ID              0
Title               0
Company             0
City                0
View.Start          0
Created.At          0
Updated.At          0
State.Name         22
State.Code         22
View.End         1795
View.Duration    1795
dtype: int64

In [ ]:
user_view  = user_view.dropna(subset=['State.Name'])

In [ ]:
# we calculate the mean of the duration and fill the missing values with it
user_view['View.Duration'] = user_view['View.Duration'].fillna(user_view['View.Duration'].mean())

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [ ]:
# we change the form of created at, updated at, view start, view end, from objects to datetime
user_view['Created.At'] = pd.to_datetime(user_view['Created.At'])
user_view['Updated.At'] = pd.to_datetime(user_view['Updated.At'])

In [ ]:
user_view['View.Start'] = pd.to_datetime(user_view['View.Start'])
user_view['View.End'] = pd.to_datetime(user_view['View.End'])

In [ ]:
# it works : )
user_view.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12348 entries, 0 to 12369
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Applicant.ID   12348 non-null  int64
 1   Job.ID         12348 non-null  int64
 2   Title          12348 non-null  object
 3   Company        12348 non-null  object
 4   City           12348 non-null  object
 5   State.Name     12348 non-null  object
 6   State.Code     12348 non-null  object
 7   View.Start     12348 non-null  datetime64[ns, UTC]
 8   View.End       10554 non-null  datetime64[ns, UTC]
 9   View.Duration  12348 non-null  float64
 10  Created.At     12348 non-null  datetime64[ns, UTC]
 11  Updated.At     12348 non-null  datetime64[ns, UTC]
dtypes: datetime64[ns, UTC](4), float64(1), int64(2), object(5)
memory usage: 1.2+ MB

In [ ]:
# we decided to not care about view end, since we have view start and the duration, that is sufficient.
user_view['View.Duration'].head()

0    1129.0
1      84.0
2     286.0
3     170.0
4      33.0
Name: View.Duration, dtype: float64

In [ ]:
# it works : )
user_view.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12348 entries, 0 to 12369
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Applicant.ID   12348 non-null  int64
 1   Job.ID         12348 non-null  int64
 2   Title          12348 non-null  object
 3   Company        12348 non-null  object
 4   City           12348 non-null  object
 5   State.Name     12348 non-null  object
 6   State.Code     12348 non-null  object
 7   View.Start     12348 non-null  datetime64[ns, UTC]
 8   View.End       10554 non-null  datetime64[ns, UTC]
 9   View.Duration  12348 non-null  float64
 10  Created.At     12348 non-null  datetime64[ns, UTC]
 11  Updated.At     12348 non-null  datetime64[ns, UTC]
dtypes: datetime64[ns, UTC](4), float64(1), int64(2), object(5)
memory usage: 1.2+ MB

In [ ]:
# it works : )
user_view.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12348 entries, 0 to 12369
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Applicant.ID   12348 non-null  int64
 1   Job.ID         12348 non-null  int64
 2   Title          12348 non-null  object
 3   Company        12348 non-null  object
 4   City           12348 non-null  object
 5   State.Name     12348 non-null  object
 6   State.Code     12348 non-null  object
 7   View.Start     12348 non-null  datetime64[ns, UTC]
 8   View.End       10554 non-null  datetime64[ns, UTC]
 9   View.Duration  12348 non-null  float64
 10  Created.At     12348 non-null  datetime64[ns, UTC]
 11  Updated.At     12348 non-null  datetime64[ns, UTC]
dtypes: datetime64[ns, UTC](4), float64(1), int64(2), object(5)
memory usage: 1.2+ MB

### User experience

In [ ]:
user_exp = pd.read_csv('https://raw.githubusercontent.com/fr3drikk/the_dream_team-/main/App/Data/user_past_experience.csv')

In [ ]:
user_exp.head()

,Applicant.ID,Position.Name,Employer.Name,City,State.Name,State.Code,Start.Date,End.Date,Job.Description,Salary,Can.Contact.Employer,Created.At,Updated.At
0,10001,Account Manager / Sales Administration / Quali...,Barcode Resourcing,Bellingham,Washington,WA,2012-10-15,NaN,NaN,NaN,NaN,2014-12-12 20:10:02 UTC,2014-12-12 20:10:02 UTC
1,10001,Electronics Technician / Item Master Controller,Ryzex Group,Bellingham,Washington,WA,2001-12-01,2012-04-01,NaN,NaN,NaN,2014-12-12 20:10:02 UTC,2014-12-12 20:10:02 UTC
2,10001,Machine Operator,comptec inc,Custer,Washington,WA,1997-01-01,1999-01-01,NaN,NaN,NaN,2014-12-12 20:10:02 UTC,2014-12-12 20:10:02 UTC
3,10003,maintenance technician,Winn residental,washington,District of Columbia,DC,NaN,NaN,"Necessary maintenance for ""Make Ready"" Plumbin...",10.0,False,2014-12-12 21:27:05 UTC,2014-12-12 21:27:05 UTC
4,10003,Electrical Helper,michael and son services,alexandria,Virginia,VA,NaN,NaN,repair and services of electrical construction,NaN,False,2014-12-12 21:27:05 UTC,2014-12-12 21:27:05 UTC

In [ ]:
user_exp.shape

(8653, 13)

In [ ]:
user_exp.isna().sum().sort_values()

Applicant.ID               0
Created.At                 0
Updated.At                 0
Employer.Name             33
Position.Name            950
Start.Date              2035
Job.Description         2961
City                    3731
End.Date                3747
State.Name              4058
State.Code              4058
Can.Contact.Employer    5072
Salary                  5855
dtype: int64

In [ ]:
user_exp['Position.Name'].value_counts()

Cashier                                              129
Sales Associate                                      116
Server                                                86
Administrative Assistant                              76
Owner                                                 58
                                                    ...
News Production Intern                                 1
Late Night with Jimmy Fallon -  Production Intern      1
Extern                                                 1
Cinematographer                                        1
Server/cocktail server/bartender                       1
Name: Position.Name, Length: 4986, dtype: int64

### User work interest

In [ ]:
user_int = pd.read_csv('https://raw.githubusercontent.com/fr3drikk/the_dream_team-/main/App/Data/user_work_interest.csv')

In [ ]:
user_int.head()

,Applicant.ID,Position.Of.Interest,Created.At,Updated.At
0,10003,security officer,2014-12-12 21:20:54 UTC,2014-12-12 21:20:54 UTC
1,10007,Server,2014-08-14 15:56:42 UTC,2015-02-26 20:35:12 UTC
2,10007,Bartender,2014-08-14 15:56:44 UTC,2015-02-19 23:21:28 UTC
3,10008,Host,2014-08-14 15:56:42 UTC,2015-02-26 20:35:12 UTC
4,10008,Barista,2014-08-14 15:56:43 UTC,2015-02-18 02:35:06 UTC

In [ ]:
user_int['Position.Of.Interest'].value_counts().nlargest(20)

In [ ]:
user_int.isna().sum().sort_values()

In [ ]:
user_int.shape

In [ ]:
user_int['Applicant.ID'].nunique()

### EDA STUFF

In [ ]:
# on average a user looks at x jobposts

In [ ]:
# on average a user spends x amount of time looking at a jobpost

In [ ]:
# a correlation matrix between education required and jobpositions (requires grouping of positions)

In [ ]:
##### text recognizitionon stuff ^

In [ ]:
# timeline with the development of jobposts , e.g. over weeks , months , years , fulltime/parttime , states , slider

In [ ]:
# seasonal peaks of jobposts ^ summer,winter,fall ETC

In [ ]:
# geoplotting , location of jobs , statebased perhaps, interactive map where you can hoover over and see the information in ze map

In [ ]:
# grade 10 , map with your recommended jobs

In [ ]:
# extra stuff for nice frontend, like a tab with cv stuff n stuff

In [ ]:
# most popular jobposts (views), compared with duration users spend on those posts, bait titles or actually interesting?

In [ ]:
# companies with most jobposts, big companies? small companies with high turnover rates? etc,

In [ ]:
# to group some of our variables